{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "size_of_axes" : 1,
      "bottom" : "poses",
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "expand_input",
      "top" : "expand_input",
      "type" : "expand_dims",
      "name" : "expand_input"
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "expand_input",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.2",
      "top" : "x.2",
      "type" : "transpose",
      "name" : "x.2"
    },
    {
      "name" : "input.1",
      "weights" : {

      },
      "dst_w" : 64,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : 54,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "x.2",
      "debug_info" : "input.1",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input.1"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "input.1",
      "axes_0" : -1,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "x.3_expanded",
      "top" : "x.3_expanded",
      "type" : "expand_dims",
      "name" : "x.3_expanded"
    },
    {
      "name" : "x.3",
      "bottom" : "x.3_expanded",
      "weights" : {

      },
      "debug_info" : "x.3",
      "top" : "x.3_batch_norm",
      "C" : 54,
      "blob_batchnorm_params" : 1,
      "type" : "batchnorm"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "x.3_batch_norm",
      "axes_0" : -1,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "x.3_squeeze",
      "version" : 1,
      "top" : "x.3",
      "type" : "squeeze",
      "name" : "x.3_squeeze"
    },
    {
      "name" : "x.4",
      "weights" : {

      },
      "dst_w" : 64,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 18,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "x.3",
      "debug_info" : "x.4",
      "dst_seq" : 1,
      "dst_k" : 3,
      "top" : "x.4"
    },
    {
      "axis_h" : 0,
      "axis_w" : 1,
      "bottom" : "x.4",
      "axis_k" : 2,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.2",
      "top" : "input.2",
      "type" : "transpose",
      "name" : "input.2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.5",
      "blob_weights" : 5,
      "K" : 3,
      "blob_biases" : 3,
      "name" : "x.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "input.2",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.5",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.6",
      "top" : "x.6",
      "type" : "transpose",
      "name" : "x.6"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.6",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "178",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "178",
      "begin_48" : 0,
      "top" : "178:0,178:1,178:2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "x.7",
      "top" : "x.7",
      "type" : "concat",
      "name" : "x.7",
      "bottom" : "178:0,178:1,178:2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.8",
      "blob_weights" : 7,
      "K" : 54,
      "name" : "x.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 18,
      "bottom" : "x.7",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.8",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.3",
      "top" : "input.3",
      "type" : "transpose",
      "name" : "input.3"
    },
    {
      "name" : "input.4",
      "bottom" : "input.3",
      "weights" : {

      },
      "debug_info" : "input.4",
      "top" : "input.4",
      "C" : 8,
      "blob_batchnorm_params" : 9,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.4",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.5",
      "top" : "input.5",
      "type" : "activation",
      "name" : "input.5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.6",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.9",
      "blob_weights" : 13,
      "K" : 8,
      "blob_biases" : 11,
      "name" : "input.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "input.5",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res.1",
      "blob_weights" : 17,
      "K" : 8,
      "blob_biases" : 15,
      "name" : "input.10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.9",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.10",
      "blob_weights" : 21,
      "K" : 8,
      "blob_biases" : 19,
      "name" : "x.10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "input.9",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.10",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.11",
      "top" : "x.11",
      "type" : "transpose",
      "name" : "x.11"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.11",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "227",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "227",
      "begin_48" : 0,
      "top" : "227:0,227:1,227:2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "x.12",
      "top" : "x.12",
      "type" : "concat",
      "name" : "x.12",
      "bottom" : "227:0,227:1,227:2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.13",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.13",
      "blob_weights" : 23,
      "K" : 54,
      "name" : "x.13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 18,
      "bottom" : "x.12",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.13",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.11",
      "top" : "input.11",
      "type" : "transpose",
      "name" : "input.11"
    },
    {
      "name" : "input.12",
      "bottom" : "input.11",
      "weights" : {

      },
      "debug_info" : "input.12",
      "top" : "input.12",
      "C" : 16,
      "blob_batchnorm_params" : 25,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.12",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.13",
      "top" : "input.13",
      "type" : "activation",
      "name" : "input.13"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.14",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.15",
      "blob_weights" : 29,
      "K" : 16,
      "blob_biases" : 27,
      "name" : "input.14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "res.1,input.15",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.16",
      "top" : "input.16",
      "type" : "elementwise",
      "name" : "input.16",
      "beta" : 0
    },
    {
      "bottom" : "input.16",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.17",
      "top" : "input.17",
      "type" : "activation",
      "name" : "input.17"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.18",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res.2",
      "blob_weights" : 33,
      "K" : 16,
      "blob_biases" : 31,
      "name" : "input.18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.17",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.15",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.15",
      "blob_weights" : 37,
      "K" : 16,
      "blob_biases" : 35,
      "name" : "x.15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "input.17",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.15",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.16",
      "top" : "x.16",
      "type" : "transpose",
      "name" : "x.16"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.16",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "275",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "275",
      "begin_48" : 0,
      "top" : "275:0,275:1,275:2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "x.17",
      "top" : "x.17",
      "type" : "concat",
      "name" : "x.17",
      "bottom" : "275:0,275:1,275:2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.18",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.18",
      "blob_weights" : 39,
      "K" : 54,
      "name" : "x.18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 18,
      "bottom" : "x.17",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.18",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.19",
      "top" : "input.19",
      "type" : "transpose",
      "name" : "input.19"
    },
    {
      "name" : "input.20",
      "bottom" : "input.19",
      "weights" : {

      },
      "debug_info" : "input.20",
      "top" : "input.20",
      "C" : 32,
      "blob_batchnorm_params" : 41,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.20",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.21",
      "top" : "input.21",
      "type" : "activation",
      "name" : "input.21"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.22",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.23",
      "blob_weights" : 45,
      "K" : 32,
      "blob_biases" : 43,
      "name" : "input.22",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.21",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "res.2,input.23",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.24",
      "top" : "input.24",
      "type" : "elementwise",
      "name" : "input.24",
      "beta" : 0
    },
    {
      "bottom" : "input.24",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.25",
      "top" : "input.25",
      "type" : "activation",
      "name" : "input.25"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.26",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res.3",
      "blob_weights" : 49,
      "K" : 32,
      "blob_biases" : 47,
      "name" : "input.26",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.25",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.20",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.20",
      "blob_weights" : 53,
      "K" : 32,
      "blob_biases" : 51,
      "name" : "x.20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.25",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.20",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.21",
      "top" : "x.21",
      "type" : "transpose",
      "name" : "x.21"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.21",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "324",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "324",
      "begin_48" : 0,
      "top" : "324:0,324:1,324:2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "x.22",
      "top" : "x.22",
      "type" : "concat",
      "name" : "x.22",
      "bottom" : "324:0,324:1,324:2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.23",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.23",
      "blob_weights" : 55,
      "K" : 54,
      "name" : "x.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 18,
      "bottom" : "x.22",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.23",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.27",
      "top" : "input.27",
      "type" : "transpose",
      "name" : "input.27"
    },
    {
      "name" : "input.28",
      "bottom" : "input.27",
      "weights" : {

      },
      "debug_info" : "input.28",
      "top" : "input.28",
      "C" : 64,
      "blob_batchnorm_params" : 57,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.28",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.29",
      "top" : "input.29",
      "type" : "activation",
      "name" : "input.29"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.30",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.31",
      "blob_weights" : 61,
      "K" : 64,
      "blob_biases" : 59,
      "name" : "input.30",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.29",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "res.3,input.31",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.32",
      "top" : "input.32",
      "type" : "elementwise",
      "name" : "input.32",
      "beta" : 0
    },
    {
      "bottom" : "input.32",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.33",
      "top" : "input.33",
      "type" : "activation",
      "name" : "input.33"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.25",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.25",
      "blob_weights" : 65,
      "K" : 64,
      "blob_biases" : 63,
      "name" : "x.25",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.33",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.25",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.26",
      "top" : "x.26",
      "type" : "transpose",
      "name" : "x.26"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.26",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "366",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "366",
      "begin_48" : 0,
      "top" : "366:0,366:1,366:2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "x.27",
      "top" : "x.27",
      "type" : "concat",
      "name" : "x.27",
      "bottom" : "366:0,366:1,366:2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.28",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.28",
      "blob_weights" : 67,
      "K" : 54,
      "name" : "x.28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 18,
      "bottom" : "x.27",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.28",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.34",
      "top" : "input.34",
      "type" : "transpose",
      "name" : "input.34"
    },
    {
      "name" : "input.35",
      "bottom" : "input.34",
      "weights" : {

      },
      "debug_info" : "input.35",
      "top" : "input.35",
      "C" : 64,
      "blob_batchnorm_params" : 69,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.35",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.36",
      "top" : "input.36",
      "type" : "activation",
      "name" : "input.36"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.37",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.38",
      "blob_weights" : 73,
      "K" : 64,
      "blob_biases" : 71,
      "name" : "input.37",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.36",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.33,input.38",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.39",
      "top" : "input.39",
      "type" : "elementwise",
      "name" : "input.39",
      "beta" : 0
    },
    {
      "bottom" : "input.39",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.40",
      "top" : "input.40",
      "type" : "activation",
      "name" : "input.40"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.41",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res.4",
      "blob_weights" : 77,
      "K" : 64,
      "blob_biases" : 75,
      "name" : "input.41",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.40",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.30",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.30",
      "blob_weights" : 81,
      "K" : 64,
      "blob_biases" : 79,
      "name" : "x.30",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.40",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.30",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.31",
      "top" : "x.31",
      "type" : "transpose",
      "name" : "x.31"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.31",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "415",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "415",
      "begin_48" : 0,
      "top" : "415:0,415:1,415:2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "x.32",
      "top" : "x.32",
      "type" : "concat",
      "name" : "x.32",
      "bottom" : "415:0,415:1,415:2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.33",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.33",
      "blob_weights" : 83,
      "K" : 54,
      "name" : "x.33",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 18,
      "bottom" : "x.32",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.33",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.42",
      "top" : "input.42",
      "type" : "transpose",
      "name" : "input.42"
    },
    {
      "name" : "input.43",
      "bottom" : "input.42",
      "weights" : {

      },
      "debug_info" : "input.43",
      "top" : "input.43",
      "C" : 128,
      "blob_batchnorm_params" : 85,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.43",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.44",
      "top" : "input.44",
      "type" : "activation",
      "name" : "input.44"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.45",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.46",
      "blob_weights" : 89,
      "K" : 128,
      "blob_biases" : 87,
      "name" : "input.45",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.44",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "res.4,input.46",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.47",
      "top" : "input.47",
      "type" : "elementwise",
      "name" : "input.47",
      "beta" : 0
    },
    {
      "bottom" : "input.47",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.48",
      "top" : "input.48",
      "type" : "activation",
      "name" : "input.48"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.49",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res",
      "blob_weights" : 93,
      "K" : 128,
      "blob_biases" : 91,
      "name" : "input.49",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.48",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.35",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.35",
      "blob_weights" : 97,
      "K" : 128,
      "blob_biases" : 95,
      "name" : "x.35",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 768,
      "bottom" : "input.48",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.35",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.36",
      "top" : "x.36",
      "type" : "transpose",
      "name" : "x.36"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.36",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "463",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "463",
      "begin_48" : 0,
      "top" : "463:0,463:1,463:2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "x.37",
      "top" : "x.37",
      "type" : "concat",
      "name" : "x.37",
      "bottom" : "463:0,463:1,463:2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.38",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.38",
      "blob_weights" : 99,
      "K" : 54,
      "name" : "x.38",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 18,
      "bottom" : "x.37",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.38",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.50",
      "top" : "input.50",
      "type" : "transpose",
      "name" : "input.50"
    },
    {
      "name" : "input.51",
      "bottom" : "input.50",
      "weights" : {

      },
      "debug_info" : "input.51",
      "top" : "input.51",
      "C" : 256,
      "blob_batchnorm_params" : 101,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.51",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.52",
      "top" : "input.52",
      "type" : "activation",
      "name" : "input.52"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.53",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.54",
      "blob_weights" : 105,
      "K" : 256,
      "blob_biases" : 103,
      "name" : "input.53",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.52",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "res,input.54",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.55",
      "top" : "input.55",
      "type" : "elementwise",
      "name" : "input.55",
